Repository: fjpady/RxMarvel
Catalog: reactive_mvvm/Resources/Translates/*.lproj/Localizable.strings
Languages: es

# Common.invalid_password
source: The password must have at least 6 characters
es: La contraseña debe tener al menos 6 caractéres

# Common.invalid_email
source: You must enter a valid email
es: Debe introducir un email válido

# Common.valid_password
source: The password is valid
es: La contraseña es válida

# Common.valid_email
source: The email is valid
es: El mail es válido

# Common.fill_fields
source: Must be fill all fields
es: Debe completar todos los campos

# Common.no_internet_connection
source: You don't have an internet connection.
es: No dispone de conexión a internet.

# LoginView.title
source: Log in reactive mvvm with Marvel!
es: Inicia sesión en reactive mvvm con Marvel!

# LoginView.mail_label
source: User email
es: Email de usuario

# LoginView.mail_placeholder
source: Type your user or email here
es: Escribe tu email aquí

# LoginView.password_label
source: Password
es: Contraseña

# LoginView.password_placeholder
source: Type your password here
es: Escribe tu contraseña aquí

# LoginView.login_button
source: Log in
es: Iniciar sesión

# LoginView.hint_connection
source: To connect use a valid email 6 characters password
es: Para conectarnos hay que usar un email válido una contraseña de al menos 6 caractéres

# SplashView.title
source: Basic Example of MVVM Application with Reactive Swift
es: Ejemplo básico de aplicación MVVM con Swift reactivo

# SplashView.list
source: * RxSwift * Mvvm pattern * Cocoa Pods (Rx only & Kingfisher) * Translates * Enviroments * Design patterns * Interface styles dark & light * Unit test * StoryBoards & xib (git friendly)
es: * RxSwift * Mvvm pattern * Cocoa Pods (solo para Rx & Kingfisher) * Traducciones * Enviroments * Patrones de diseño * Interface styles dark & light * Test unitarios * StoryBoards & xib (best for git)

# SplashView.continue
source: Continue
es: Continuar

# CharacterListView.title
source: Marvel characters
es: Personajes de Marvel

# CharacterListView.search_bar
source: Find a character
es: Buscar un personaje

# CharacterCell.description
source: Description:
es: Descripción:

# CharacterDetailsView.title
source: Title:
es: Título:

# CharacterDetailsView.description
source: Description:
es: Descripción:

# CharacterDetailsView.stories
source: Stories
es: Historias

# CharacterDetailsView.events
source: Events
es: Eventos

# CharacterDetailsView.stories_amount
source: %@ stories
es: %@ historias

# CharacterDetailsView.events_amount
source: %@ events
es: %@ eventos
